#1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
#- 6 -> да
#- 7 -> да
#- 1 -> нет

a = int(input("Ведите день недели ->"))
if a>7 or a<=0:
    print("Нет такого дня ")
elif a>5 and a<8:
    print("Выходной")
else:
    print("Рабочий день")